tap "homebrew/bundle"
# Programmable completion for Bash 4.2+
brew "bash-completion@2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Blazing fast terminal-ui for git written in rust
brew "gitui"
# Improved colored diff
brew "icdiff"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Pager program similar to more
brew "less"
# Powerful multi-lingual file viewer/grep
brew "lv"
# Network Kanji code conversion Filter (NKF)
brew "nkf"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Rust toolchain installer
brew "rustup-init"
# Source-code syntax highlighter
brew "source-highlight"
# Cross-shell prompt for astronauts
brew "starship"
# Vi 'workalike' with many additional features
brew "vim"
# Access X11 clipboards from the command-line
brew "xclip"
# Shell extension to navigate your filesystem faster
brew "zoxide"
