tap "homebrew/bundle"
tap "homebrew/core"
brew "bash-completion@2"
brew "bat"
brew "bottom"
brew "exa"
brew "fd"
brew "fzf"
brew "git"
brew "git-delta"
brew "gitui"
brew "jq"
brew "ripgrep"
brew "source-highlight"
brew "starship"
brew "vim"
brew "xclip"
brew "zoxide"
